####################################################################################
#
# Generated by eda_pt_script.tcl	#1
#              eda_pt_generate.tcl	#1
#              in c:/altera/91sp2/quartus/common/tcl/internal/eda_pt/.
#
# Quartus:  Version 9.1 Build 350 03/24/2010 Service Pack 2 SJ Web Edition
#
# Project:  final
# Revision: final
# Device:   EP3C16F484C6
#
# Date: Tue Jun 15 14:41:48 +0800 2021
#
# Copyright (C) 1991-2010 Altera Corporation
#
####################################################################################


##################
# Header Section #
##################

# This Tcl script should be used for PrimeTime (Verilog) only
set report_default_significant_digits 3
set hierarchy_separator .
set quartus_root "c:/altera/91sp2/quartus/"
set search_path [list . [format "%s%s" $quartus_root "eda/synopsys/primetime/lib"] ]
set link_path [list * cycloneiii_atoms.db bb2_lib.db  alt_vtl.db]
read_verilog cycloneiii_all_pt.v


########################
# Design Entry Section #
########################

read_verilog final.vo
current_design final
link
set_operating_conditions -analysis_type on_chip_variation
## Use "slow" for slow corner or "fast" for fast corner
set corner slow
if [string equal -nocase $corner slow] {
	read_sdf -analysis_type on_chip_variation final_v.sdo
} elseif [string equal -nocase $corner fast] {
	read_sdf -analysis_type on_chip_variation final_v_fast.sdo
}
## To remove clock reconvergence pessimism, uncomment the following line:
## set timing_remove_clock_reconvergence_pessimism true


######################
# Timing Constraints #
######################

source final.collections.sdc
source final.constraints.sdc

########################
# Output Pins Loadings #
########################

# Pin led[0] ( Location = J1 )
set_load -pin_load 0 [get_ports { {led[0]} } ]
# Pin led[1] ( Location = J2 )
set_load -pin_load 0 [get_ports { {led[1]} } ]
# Pin led[2] ( Location = J3 )
set_load -pin_load 0 [get_ports { {led[2]} } ]
# Pin led[3] ( Location = H1 )
set_load -pin_load 0 [get_ports { {led[3]} } ]
# Pin led[4] ( Location = F2 )
set_load -pin_load 0 [get_ports { {led[4]} } ]
# Pin outa[0] ( Location = A13 )
set_load -pin_load 0 [get_ports { {outa[0]} } ]
# Pin outa[1] ( Location = B13 )
set_load -pin_load 0 [get_ports { {outa[1]} } ]
# Pin outa[2] ( Location = C13 )
set_load -pin_load 0 [get_ports { {outa[2]} } ]
# Pin outa[3] ( Location = A14 )
set_load -pin_load 0 [get_ports { {outa[3]} } ]
# Pin outa[4] ( Location = B14 )
set_load -pin_load 0 [get_ports { {outa[4]} } ]
# Pin outa[5] ( Location = E14 )
set_load -pin_load 0 [get_ports { {outa[5]} } ]
# Pin outa[6] ( Location = A15 )
set_load -pin_load 0 [get_ports { {outa[6]} } ]
# Pin outa[7] ( Location = B15 )
set_load -pin_load 0 [get_ports { {outa[7]} } ]
# Pin outb[0] ( Location = E11 )
set_load -pin_load 0 [get_ports { {outb[0]} } ]
# Pin outb[1] ( Location = F11 )
set_load -pin_load 0 [get_ports { {outb[1]} } ]
# Pin outb[2] ( Location = H12 )
set_load -pin_load 0 [get_ports { {outb[2]} } ]
# Pin outb[3] ( Location = H13 )
set_load -pin_load 0 [get_ports { {outb[3]} } ]
# Pin outb[4] ( Location = G12 )
set_load -pin_load 0 [get_ports { {outb[4]} } ]
# Pin outb[5] ( Location = F12 )
set_load -pin_load 0 [get_ports { {outb[5]} } ]
# Pin outb[6] ( Location = F13 )
set_load -pin_load 0 [get_ports { {outb[6]} } ]
# Pin outb[7] ( Location = D13 )
set_load -pin_load 0 [get_ports { {outb[7]} } ]
# Pin outc[0] ( Location = B18 )
set_load -pin_load 0 [get_ports { {outc[0]} } ]
# Pin outc[1] ( Location = F15 )
set_load -pin_load 0 [get_ports { {outc[1]} } ]
# Pin outc[2] ( Location = A19 )
set_load -pin_load 0 [get_ports { {outc[2]} } ]
# Pin outc[3] ( Location = B19 )
set_load -pin_load 0 [get_ports { {outc[3]} } ]
# Pin outc[4] ( Location = C19 )
set_load -pin_load 0 [get_ports { {outc[4]} } ]
# Pin outc[5] ( Location = D19 )
set_load -pin_load 0 [get_ports { {outc[5]} } ]
# Pin outc[6] ( Location = G15 )
set_load -pin_load 0 [get_ports { {outc[6]} } ]
# Pin outc[7] ( Location = G16 )
set_load -pin_load 0 [get_ports { {outc[7]} } ]
# Pin outd[0] ( Location = D15 )
set_load -pin_load 0 [get_ports { {outd[0]} } ]
# Pin outd[1] ( Location = A16 )
set_load -pin_load 0 [get_ports { {outd[1]} } ]
# Pin outd[2] ( Location = B16 )
set_load -pin_load 0 [get_ports { {outd[2]} } ]
# Pin outd[3] ( Location = E15 )
set_load -pin_load 0 [get_ports { {outd[3]} } ]
# Pin outd[4] ( Location = A17 )
set_load -pin_load 0 [get_ports { {outd[4]} } ]
# Pin outd[5] ( Location = B17 )
set_load -pin_load 0 [get_ports { {outd[5]} } ]
# Pin outd[6] ( Location = F14 )
set_load -pin_load 0 [get_ports { {outd[6]} } ]
# Pin outd[7] ( Location = A18 )
set_load -pin_load 0 [get_ports { {outd[7]} } ]
